# CreateDouble Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..CreateDouble Method
IFCData Class See Also
---
Creates a double data object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static IFCData CreateDouble(
	double value
)
```

Visual Basic
---
```text
Public Shared Function CreateDouble ( _
	value As Double _
) As IFCData
```

Visual C++
---
```text
public:
static IFCData^ CreateDouble(
	double value
)
```

# ### Parameters
value
    Type: System..::..Double The double value.
# ### Return Value
The IFCData object.
# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace